[
{"title": "Director, Mobile App - Customer Support Digital Strategy", "link": "https://de.jobsyn.org/91D370C20AA14B1290A83DB8AD730B4C88", "organization": "Samsung Electronics America", "city": null, "region": "California", "country": "United States", "posted_date": "2022-06-22T01:59:47-04:00", "description": "Position Summary Making the future is everyday life at Samsung. We are seeking innovators who are called to not just change the world, but build a better one. We make the best technology hardware on the planet, but our best is always a prototype for something better and our people thrive with a driven mindset – better builds on better. As the Director of Samsung Care Digital Mobile App Program Management, your north star is focusing on mobile app customer support strategy, roadmap and deliver results. Your objective is to transform the way we interact and service our customers on the mobile app platform. You will be asked to optimize and scale the self-service customer support mobile capabilities, utilizing an Omni-channel lens. Your goal is to deliver best in class, frictionless mobile customer experiences, which will ultimately increase NPS, reduce customer contacts, CS operations cost and survey triggers. You will demonstrate a deep understanding and knowledge of mobile platform strategies by enhancing self-service capabilities in digital and voice channels and connecting customer experience across customer support channels. You are comfortable working with complex challenges and understand the value of rapid test and learn approaches. You think creatively and succeed as a leader because you are passionate about delivering mobile app solutions that exceed customer expectations. Position Location: Ridgefield Park, NJ, Dallas or Austin, TX or Remote Home Office Role and Responsibilities Benchmark best in class consumer experiences to inform and guide customers on the mobile app platform, keeping a keen eye on key business targets and goals. Identify and develop best practices, utilizing data and consumer research to define the future state vision for Samsung’s mobile app. Define, shape, monitor and report out on mobile experience KPI’s. Partner internally to develop and distribute dashboard reporting. Take a data-driven product approach, defining and reporting on key metrics and optimizing them against those metrics. Partner with various organizations (Contact Center, Field Services and Web Development Engineering) to align with the development of a mobile app self-service strategy that can power an Omni-channel experience. Write detailed business requirements based on inputs from internal and external stakeholders. Provide actionable insights and processes for execution that drive future mobile experiences. and optimize current experiences across mobile customer lifecycles. This includes driving innovation for customer support systems and platforms. Collaborate with web product owners & engineering to prioritize features, sprint plan, groom, and execute new features and functionality. Manage and drive cross-functional coordination for the selected top initiatives to ensure continual progress and on-time delivery, while adhering to budget constraints. Develop, monitor and maintain a tight roadmap timeline of all initiatives to ensure constant alignment of all key stakeholders. Drive roadmap discussions making quantified and justifiable trade-off decisions in scope, date, and quality. Actively contribute to the drive of the digital mix by increasing digital volume % of total customer contact volume (voice and digital). Be the voice of innovation in key stakeholder meetings to bring the mobile channel service experience to life. Work with external vendor(s) for solution development. Develop and execute presentations, executive summaries and steering committee decks. Effectively deliver key messages around the project status/risks to leadership. Collaboration with external partners, peers, and internal teams to deliver and execute the strategy. Skills and Qualifications Knowledge expertise/experience Bachelor’s degree required 15+ years of relevant experience in Customer Support Mobile App product management, operations, technology 10+ years working in the customer support industry or a multi-national corporation preferred Deep expertise in digital mobile app strategies Business acumen and communication skills to act as a thought partner within the mobile space Highly developed understanding of digital commerce business drivers impacting top and bottom line, as well as the ability to interpret digital analytics to implement and drive strategy. Experience in strategy development and execution, product management, and/or mobile app management Omni-channel visions and executions Demonstrated understanding of customer experience with a strong ability to combine product knowledge, data, and creativity to build solutions to business challenges. Working experience in a part of a large or enterprise digital self-service or Omni-channel deployment and implementation. Project management a plus Experience in people management a plus An ambitious self-starter with excellent follow-through skills to develop ideas independently and thrive in a fast paced environment Ability and willingness to roll up sleeve and execute to get the job done and while thinking big picture at the same time Strong drive for results with the ability to manage independently and take calculated risks Must be comfortable working with and understanding data. Ability to use data to inform decisions and present outcomes; use it to tell a compelling story Proven ability to manage multiple, competing priorities and deadlines in a fast-paced and ever-changing environment Track record in leading end-to-end deliveries of high-quality products and experiences Track record of working cross functionally in a large organization Digital background working in both mobile app and web environments Acumen for building relationships with peers, business partners and leadership Excellent good presentation skills Exceptional verbal and written communication skills Global mindset Samsung Electronics America, Inc. is committed to employing a diverse workforce, and provides Equal Employment Opportunity for all individuals regardless of race, color, religion, gender, age, national origin, marital status, sexual orientation, gender identity, status as a protected veteran, genetic information, status as a qualified individual with a disability, or any other characteristic protected by law. #LI-RL1 Please visit Samsung membership (https://account.samsung.com/membership/pp) to see Privacy Policy, which defaults according to your location. You can change Country/Language at the bottom of the page. If you are European Economic Resident, please click here (http://ghrp.europe-samsung.com/PrivacyNoticeforEU.html) . Samsung Electronics America, Inc. and its subsidiaries are committed to employing a diverse workforce, and provide Equal Employment Opportunity for all individuals regardless of race, color, religion, gender, age, national origin, marital status, sexual orientation, gender identity, status as a protected veteran, genetic information, status as a qualified individual with a disability, or any other characteristic protected by law. COVID-19 Vaccine Mandate In order to comply with the federal vaccine mandate, Samsung Electronics America requires all employees to be fully vaccinated against COVID-19, unless a medical or religious exemption, or an exemption required under state/local law, is approved. Offers of employment are contingent upon proof that a candidate is fully vaccinated or qualifies for an exemption. More details on how to apply for an exemption are provided after the application process is complete. Reasonable Accommodations for Qualified Individuals with Disabilities During the Application Process Samsung Electronics America is committed to providing reasonable accommodations for qualified individuals with disabilities in our job application process. If you have a disability and require a reasonable accommodation in order to participate in the application process, please contact our Reasonable Accommodation Team (855-557-3247) or SEAAccommodationsExt@sea.samsung.com for assistance. This number is for accommodation requests only and is not intended for general employment inquiries. Job Alerts : If you would like to be notified of new opportunities when they are posted, please click here (https://sec.wd3.myworkdayjobs.com/Samsung_Careers/jobAlerts) . You will be asked to create an account first if you do not already have one. Samsung Electronics is a global leader in technology, opening new possibilities for people everywhere. Through relentless innovation and discovery, we are transforming the worlds of TVs, smartphones, wearable devices, tablets, digital appliances, and network systems, and the entire semiconductor industry with our memory, system LSI, foundry, and LED solutions. Samsung is also leading in the development of the Internet of Things through, among others, our Smart Home and Digital Health initiatives. Since being established in 1969 , Samsung Electronics has grown into one of the world’s leading technology companies, and become recognized as one of the top global brands. Our network now extends across the world, and Samsung takes great pride in the creativity and diversity of its talented people, who drive our growth. To discover more, please visit our official newsroom at ( https://news.samsung.com/global/ )."},
{"title": "Plumbing Engineer", "link": "https://de.jobsyn.org/932AC611623344208937CF4D8B9BD48E88", "organization": "WSP USA", "city": "Greenwood Village", "region": "Colorado", "country": "United States", "posted_date": "2022-06-22T05:51:16-04:00", "description": "Plumbing Engineer Req ID 6011 Plumbing Engineer Who We Are At WSP, we are driven by inspiring future-ready pioneers to innovate. We’re looking to grow our teams with people who are ready to collaborate in building communities and expanding our skylines. To do this, we hire candidates of all backgrounds. That’s why here at WSP, inclusion, diversity, equity and belonging are core principles. Anything is within our reach and yours as a WSP employee. Come join us and help shape the future! This Opportunity Be involved in projects with our Property & Buildings Team and be a part of a growing organization that meets our client’s objectives and solves their challenges. WSP is currently initiating a search for a Plumbing Engineer for our Denver, Colorado office. As a Plumbing Engineer you will work on high-quality local, regional, as well as high-profile national and international projects. You will actively participate in the full project cycle, from the design phase through the final construction close out. We work in close collaboration with the entire project team, ensuring optimal integration of all systems. Your Impact Design: Develop drawing and specification documents Design automatic control system and specifications Design plumbing systems (domestic water, waste, vent, storm, medical gases, lab gases, etc.) Analytics: Select major equipment and schedule usage Perform piping load calculations and sizing Produce high quality technical and professional deliverables for projects and proposals Utilize advanced analytical and design techniques to solve technical problems Survey and evaluate existing conditions Prepare reports Collaboration: Provide guidance to entry level engineers Propose creative solutions to complex problems as part of team Attend team and or project meetings and interface with internal groups Communicate system design decisions to senior quality assurance staff to ensure proper application and adherence to project scope Participate in local professional organization (attend meetings/lectures) Exercise responsible and ethical decision-making regarding company funds, resources and conduct and adhere to WSP’s Code of Conduct and related policies and procedures Other duties as required by business needs Who You Are Required Qualifications BSME or BSAE degree 3 to 5 years in our industry doing design and construction document development as well as construction administration Ability to coordinate with agency regulators and understand requirements. Knowledge of relevant mechanical system and construction laws, codes, regulations, compliance practices, and record-keeping requirements. Capable interpersonal and communication skills when interacting with others, expressing ideas effectively and professionally to an engineering and non-engineering audience. Effective self-leadership with attention to detail, results orientation, and managing multiple priorities in a dynamic work environment. Ability to learn new techniques, perform multiple tasks simultaneously, follow instruction, work independently, and comply with company policies. Moderate proficiency with technical writing, office automation, software, technology, math principles, predictive models, spreadsheets, and tools. Experience with discipline-specific design software (i.e., Revit and AutoCAD). Critical thinking and problem-solving skills required to apply technical knowledge to reach conclusions from testing results, data collation, load calculations, statistical analysis and arriving at the most effective, economical, and logical solution. Proven track record of upholding workplace safety and ability to abide by WSP’s health, safety and drug/alcohol and harassment policies. Ability to work schedules conducive to project-specific requirements that may extend beyond the typical workweek. Occasional travel may be required depending on project-specific requirements. Preferred Qualifications: EIT certification Membership and involvement in relevant industry organizations. Working understanding of Quality Control and other continuous improvement processes. Compensation and Benefits: WSP provides a comprehensive suite of benefits including medical, dental, vision, disability, life, and retirement savings focused on a providing health and financial stability throughout the employee’s career. Expected Salary: $77,600 - $124,100 WSP USA is providing the compensation range and general description of other compensation and benefits that the company in good faith believes it might pay and/or offer for this position based on the successful applicant’s education, experience, knowledge, skills, and abilities in addition to internal equity and geographic location. WSP USA reserves the right to ultimately pay more or less than the posted range and offer additional benefits and other compensation, depending on circumstances not related to an applicant’s sex or other status protected by local, state, or federal law. #LI-RF1 Additional Requirements To perform this job successfully, an individual must be able to perform each essential job duty satisfactorily. Reasonable accommodations may be made to enable qualified individuals with disabilities to perform essential job functions. Additional Details Travel Required: 10% Job Status: Regular Employee Type: Full Primary Location: DENVER - DTC PKWY All locations: US-CO-Arvada, US-CO-Aurora, US-CO-Denver, US-CO-Greenwood Village, US-CO-Lakewood About WSP WSP USA is the U.S. operating company of WSP, one of the world's leading engineering and professional services firms. Dedicated to serving local communities, we are engineers, planners, technical experts, strategic advisors and construction management professionals. WSP USA designs lasting solutions in the buildings, transportation, energy, water and environment markets. With more than 12,000 employees in over 200 offices across the U.S., we partner with our clients to help communities prosper. www.wsp.com WSP provides a comprehensive suite of benefits including medical, dental, vision, disability, life, and retirement savings focused on a providing health and financial stability throughout the employee’s career. At WSP, we want to give our employees the challenges they seek to grow their careers and knowledge base. Your daily contributions to your team will be essential in meeting client objectives, goals and challenges. Are you ready to get started? WSP USA (and all of its U.S. companies) is an Equal Opportunity Employer Race/Age/Color/Religion/Sex/Sexual Orientation/Gender Identity/National Origin/Disability or Protected Veteran Status. The selected candidate must be authorized to work in the United States.#LI-HYBRID"},
{"title": "Supply Chain Process Lead", "link": "https://de.jobsyn.org/147B93D8E07242B683AC5CE5273BE20588", "organization": "Nike", "city": "Memphis", "region": "Tennessee", "country": "United States", "posted_date": "2022-06-22T02:40:08-04:00", "description": "WHAT YOU BRING Bachelor degree or equivalent combination of education and experience and training Minimum of three years relevant work experience, portfolio management experience preferred. Ability to effectively communicate to leadership to influence decision making and implement project deliverables Possess strong interpersonal skills, excellent attention to detail, and strong analytical skills Proven track record to work in a fast-paced environment that requires quick thinking and effective multitasking Experience working with 3PL partners and/or in a Distribution Center is a plus Experience with the lean process or an equivalent is a plus Willing to travel up to 10% WHO WE ARE LOOKING FOR We are looking for a 3PL Process Lead to join the North America 3PL Operations team. You will support the 3PL Operations team, projects driving our Purpose, and continuous improvement portfolio to meet Nike’s growth targets and our End to End Supply Chain vision. You will ensure that our portfolio of projects deliver the intended value to our consumers and business partners. WHAT YOU WILL WORK ON Drive development of the three-year roadmap. Build and deploy best in class Portfolio Management methodologies. Own portfolio status reporting, dependency mapping, and resource management tools and methodologies. Drive annual and Quarterly planning and prioritization process. Support and prepare Sponsor Portfolio reviews, reports, decks, agendas and content. Partner with the PMO and Technology on prioritization of work. Partner with Business on forecasted projects, prioritization, and intake. WHO YOU WILL WORK WITH You will partner closely with the 3PL Operations team and 3PL NLS team in addition to other cross-functional leaders in Market Place Operations, Inventory, DSM, Finance and Logistics to manage and prioritize the 3PL continuous improvement portfolio. NIKE, Inc. is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, protected veteran status, or disability. NIKE is committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the employment process, please call +1 503-671-4156 and let us know the nature of your request, your location and your contact information."},
{"title": "Senior Sales Consultant", "link": "https://de.jobsyn.org/1F26DA11180A4961A18F884B718545DD88", "organization": "Oracle", "city": "Annapolis", "region": "Maryland", "country": "United States", "posted_date": "2022-06-22T04:36:26-04:00", "description": "Job Description Provides direction and specialist knowledge in applying the technology/application to client business. Facilitation of customer product/application understanding through presentations demonstrations and benchmarks; provision of support throughout the sell. Responsibilities Seeking an SE for the ODNA Siebel and EBS install base About Us Diversity and Inclusion: An Oracle career can span industries, roles, Countries and cultures, giving you the opportunity to flourish in new roles and innovate, while blending work life in. Oracle has thrived through 40+ years of change by innovating and operating with integrity while delivering for the top companies in almost every industry. In order to nurture the talent that makes this happen, we are committed to an inclusive culture that celebrates and values diverse insights and perspectives, a workforce that inspires thought leadership and innovation. Oracle offers a highly competitive suite of Employee Benefits designed on the principles of parity, consistency, and affordability. The overall package includes certain core elements such as Medical, Life Insurance, access to Retirement Planning, and much more. We also encourage our employees to engage in the culture of giving back to the communities where we live and do business. At Oracle, we believe that innovation starts with diversity and inclusion and to create the future we need talent from various backgrounds, perspectives, and abilities. We ensure that individuals with disabilities are provided reasonable accommodation to successfully participate in the job application, interview process, and in potential roles. to perform crucial job functions. That’s why we’re committed to creating a workforce where all individuals can do their best work. It’s when everyone’s voice is heard and valued that we’re inspired to go beyond what’s been done before. Disclaimer: Oracle is an Equal Employment Opportunity Employer * . All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans’ status, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law. * Which includes being a United States Affirmative Action Employer"},
{"title": "Director, Strategy Communications - Opportunity for Working Remotely", "link": "https://de.jobsyn.org/48E515928D484A9384FF6D3035FF982D88", "organization": "VMware", "city": "Washington", "region": "District Of Columbia", "country": "United States", "posted_date": "2022-06-22T04:48:37-04:00", "description": "Preview: Why will you enjoy this new opportunity? You will have the chance to actively engage in VMware's transformation, specifically the Worldwide Partner & Commercial Organization's role in driving customer-for-life value through our Cloud-Smart partner ecosystem.When you're working for a company that shares your values, it's easier to enjoy what you do. At VMware we unite under a core set of EPIC2 Values: Execution, Passion, Integrity, Customer, and Community. Our guiding principle is \"innovate in everything\". Each day you will be challenged to bring curiosity, diversity, and an eagerness to collaborate toward bold ideas across all aspects of our business. We do it with a spirit of inclusion and trust acting as 'One VMware' to help our customers win. Success in the Role: What are the performance outcomes over the first 6-12 months you will work toward completing? You will drive stakeholder engagement in our transformation by developing a strategic communications framework that includes our vision for the Cloud-Smart partner ecosystem, stakeholder mapping, and key message development tailored for stakeholder groups. You will work with the organization's leadership team to stay abreast of the execution priorities and catalog key accomplishments, new capabilities and successful outcomes resulting from our work and partner with the marcomm team to provide guidance on content development for multi-channel distribution. The Work: What type of work will you be doing? What assignments, requirements, or skills will you be performing on a regular basis? Business acumen is required to successfully execute in this role. Experience in strategic communications and channels is paramount. Demonstrated, high proficiency in written and verbal communications skills for all levels of the organization and external stakeholders is critical. You will be expected to synthesize multiple execution priorities and their associated workstreams to promote and highlight the most important achievements that are helping VMware to realize its company vision and that of the Worldwide Partner & Commercial Organization. ​​ What is the leadership like for this role? What is the structure and culture of the team like? Join a team that has bright minds, a supportive and respectful environment, a commitment to excellence and a transparent leadership team, all within a company with one of the best cultures in the world. Where is this role located? Remote: This role is fully remote, allowing you the flexibility to work from the location you feel most productive and comfortable. You will be expected to live within 0-4 time zones of the primary location. What are the benefits and perks of working at VMware? You and your loved ones will be supported with a competitive and comprehensive benefits package. Below are some highlights, or you can view the complete benefits package by visiting www.benefits.vmware.com. Employee Stock Purchase Plan Medical Coverage, Retirement, and Parental Leave Plans for All Family Types Generous Time Off Programs 40 hours of paid time to volunteer in your community Rethink's Neurodiversity program to support parents raising children with learning or behavior challenges, or developmental disabilities Financial contributions to your ongoing development (conference participation, trainings, course work, etc.) Wellness reimbursement and online fitness and wellbeing classes This job may require the candidate to travel and/or work from a facility that requires full vaccination prior to entry. Category : Marketing Subcategory: Marketing Experience: Business Leadership Full Time/ Part Time: Full Time Posted Date: 2022-06-21 VMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what’s possible today at http://careers.vmware.com. Equal Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law."},
{"title": "FT-Sales Associate - Paint-Closing", "link": "https://de.jobsyn.org/69EF67B72C844A6EBC0F5C4E090AE15588", "organization": "Lowe's", "city": "Plymouth", "region": "Minnesota", "country": "United States", "posted_date": "2022-06-22T01:55:30-04:00", "description": "What You Will Do All Lowe’s associates deliver quality customer service while maintaining a store that is clean, safe, and stocked with the products customers need. As a Customer Service Associate, this means: • Being friendly and professional, welcoming customers to Lowe’s and helping with home improvement project needs. • Validating loading tickets and processing orders and deliveries accurately so customers receive merchandise as expected and in a timely manner. • Engaging in safe work practices and encouraging others to do the same. The Customer Service Associate is responsible for customers’ experience with Lowe’s. This associate plays a critical role in helping our customers select the right products, ensuring quotes are accurate, verifying correct price labels, and confirming that all customer needs are met. In addition, this associate delivers excellent customer service by listening to customers, using expertise to help customers, and loading merchandise for customers. This associate must always remain vigilant and report any safety or security concerns around the entrance of the store. The Customer Service Associate responsibilities vary dependent on the department he/she supports. Customer Service Associates work in one of the following areas: Appliances, Cabinets, Flooring, Live Nursery, Millwork, Fashion Plumbing, Outlet, Tool Rental, Pro, or Windows & Walls. Individuals applying for a role as a Customer Service Associate may be considered for any one of these areas, depending on hiring needs and skillset. Travel Requirements: This role does not require regular travel; however, this role may need to travel on occasion to meetings, trainings, or to support neighboring stores. What We're Looking For • Hourly Full Time or Part Time: Generally scheduled 39 to 40 or up to 25 hours per week, respectively; more hours may be required based on the needs of the store. • Requires morning, afternoon and evening availability any day of the week. • Physical ability to perform tasks that may require prolonged standing, sitting, and other activities necessary to perform job duties. • CSAs assigned to the Greeter departments (available in select stores) minimally must be able to lift 10 pounds without assistance; may lift over 10 pounds with or without assistance. • CSAs assigned to all other departments (excluding Greeter departments) minimally must be able to lift 25 pounds without assistance; may lift over 25 pounds with or without assistance. What You Need To Succeed Minimum Qualifications • 6 months of experience using a computer, including inputting, accessing, modifying, or outputting information. • 6 months experience using common retail technology, such as smart phones and tablets. • Ability to obtain sales related licensure or registration as may be required by law. Preferred Qualifications • 6 months of sales experience identifying and selling products based on customer needs, including credit cards, installations, add-on sales, and explaining warranties, product features, and benefits. • 6 months of retail experience providing customer service, including identifying and resolving customer issues, assisting customers in locating product, greeting customers, answering phones, building relationships with customers, and thanking customers for their business. • Bi-lingual skills, if applicable to the store. • Certification in trade related to department (e.g., hardware, kitchen, plumbing, electrical, lawn and garden, and lumber/building materials). EEO Statement Lowe’s is an equal opportunity employer and administers all personnel practices without regard to race, color, religious creed, sex, gender, age, ancestry, national origin, mental or physical disability or medical condition, sexual orientation, gender identity or expression, marital status, military or veteran status, genetic information, or any other category protected under federal, state, or local law."},
{"title": "Physical Therapist Assistant - PTA - Full Time", "link": "https://de.jobsyn.org/6448D2EAB4D94245A5F9DDB0E209D15F88", "organization": "ProMedica Health System", "city": "Boynton Beach", "region": "Florida", "country": "United States", "posted_date": "2022-06-22T01:33:29-04:00", "description": "Who is HCR ManorCare A wholly-owned subsidiary of ProMedica Mission-based, not-for-profit integrated healthcare organization 50,000 + employees nationwide A network of over 400 skilled nursing and rehabilitation, memory care, assisted living, outpatient rehabilitation, hospice and home health care locations. What do we look for in an employee We are currently seeking a passionate and motivated Physical Therapist Assistant- PTA. Are you passionate about a significant and rewarding career assisting our patients in a time of need If so, we are looking for you! Our Physical Therapist Assistants are the cornerstone to HCR ManorCare's dedication to our mission of providing top quality care to our patients. Our goal is to equip you with the direction and training along with advanced tools and technology to build our culture in line with our philosophy. We aim to employ a PTA that has a similar passion focused on the care that our patients deserve! Do you believe our mission aligns with the direction you envision your career growing What are some of the major job functions of our Physical Therapist Assistants - PTAs Assist Physical Therapist in treatment for the patient, and assist them with exercises and performing daily activities Interview patients, perform a physical examination, gain and update medical history from the patient Conduct manual exercises and assist patients in performing activities Assist in utilizing devices to support your patient s recovery like crutches or a wheelchair What are the PERKS of working here In addition to great pay, generous time off, and a wide variety of benefits, you'll also be a part of a culture focused on team spirit, work/life balance and unlimited growth opportunities to take your career to the next level. Let us bring out the best in you! What qualifies me to be a PTA with HCR ManorCare 536 - ManorCare Health Services - Boynton Beach, Florida Licensed or eligible for licensure in applicable state where working Job Specific Details: Tuesday- Saturday. Equal Opportunity Employer Qualified applicants will receive consideration for employment without regard to race, color, national origin, ancestry, religion, sex/gender (including pregnancy), sexual orientation, gender identity or gender expression, age, physical or mental disability, military or protected veteran status, citizenship, familial or marital status, genetics, or any other legally protected category. In compliance with the Americans with Disabilities Act Amendment Act (ADAAA), if you have a disability and would like to request an accommodation in order to apply for a job with ProMedica Senior Care, please contact jobline@hcr-manorcare.com."},
{"title": "LEAD, HOUSEKEEPER (FULL-TIME)", "link": "https://de.jobsyn.org/FE0AB607D72F4EE58036203C7828178188", "organization": "Compass Group, North America", "city": "Mobile", "region": "Alabama", "country": "United States", "posted_date": "2022-06-22T02:29:24-04:00", "description": "TouchPoint We are hiring immediately for a full-time LEAD, HOUSEKEEPERposition. Location: Providence Hospital - 6801 Airport Blvd., Mobile, AL 36608. Note: online applications accepted only. Schedule: Full-time schedule. 8:00am - 4:30pm; days may vary. More details upon interview. Requirement: Skilled in customer service, preferred experience in a hospital setting. COVID vaccination required. *Internal Employee Referral Bonus Available Positions at this location require proof of COVID-19 vaccination, boosters, and/or regular COVID testing. Where permitted by law, applicants who are offered a position for this location may be asked about their vaccination status, which must meet minimum business requirements. All religious, medical, or other legally recognized exemptions regarding vaccination status will be considered. We Make Applying Easy! Want to apply to this job via text messaging? Text JOB to 75000 and search requisition ID number 1036132. The advertised program is an AI recruiting assistant that helps you apply to jobs with Compass Group. Message frequency varies. Message and data rates may apply. Text STOP to opt out or HELP for help. Terms and conditions: http://olivia.paradox.ai/moSkg Diversity of thought and inclusion for all is what drives our success - we invite you to start your journey with us today! If serving others is in your blood and you thrive on the idea of helping someone heal, TouchPoint is the place for you! We asked some of our associates why they love working for Touchpoint. Click here (https://vimeo.com/329375204) to see what they said! We’re TouchPoint Support Services and our mission is to serve up hospitality, for patients, their families and visitors at Ascension Health hospitals throughout the U.S. But our work isn’t just about cooking, serving, cleaning and transporting patients. We set the stage for healing with sparkling facilities, great food and service. This is the kind of work that takes a big heart for service and for supporting Ascension’s mission to improve the health of the poor and vulnerable. We’re serious about the role we play in healing – and just as passionate about having fun, supporting each other and serving our communities. Maybe you have a passion for people and an obsession with service. Or maybe you’re looking for a launchpad for a career managing people. Are you generous and hard working? When you spot a need, are you ready to jump? Job Summary Summary: Supervises, trains and inspects the performance of assigned housekeeping staff to ensure all procedures are completed to unit's standards. Assists where necessary to ensure optimum service to guests. Essential Duties and Responsibilities: Provides quality service to customers by providing one-on-one attention to detail. Ensures assigned staff have reported to work and clocked in properly; documents late or absent employees. Resolves internal/external guest complaints to ensure guest satisfaction. Documents call offs, and replaces for any shift. Coordinates assigned staff breaks. Prepares and distributes assignment sheets to staff and reviews priorities. Communicates additions or changes to the assignment sheets as they arise throughout the shift. Assigns designated keys, radios and beepers to assigned staff. Maintains accurate record of such assignments and ensure security of keys. Checks all equipment used by staff for proper supplies, neatness, cleanliness and mechanical problems. Instructs designated personnel to correct deficiencies. Inspects areas to confirm cleaning standards have been met. Assists staff to ensure highest standards of cleanliness and service. Conducts staff training as assigned. Contributes to the team; exhibits professionalism with customers, fellow employees and others. Performs other duties as assigned. Associates at Touchpoint are offered many fantastic benefits. Both full-time and part-time positions offer the following benefits to associates: Retirement Plan Associate Shopping Program Health and Wellness Programs Discount Marketplace Identity Theft Protection Pet Insurance Voluntary Benefits, including Critical Illness Insurance, Accident Insurance, Hospital Indemnity Insurance, Legal Services, and Choice Auto and Home Program In addition, full-time positions also offer the following benefits to associates: Medical Dental Vision Life Insurance/AD Disability Insurance Commuter Benefits Employee Assistance Program Flexible Spending Accounts (FSAs) About Compass Group: Achieving leadership in the foodservice industry Compass Group is an equal opportunity employer. At Compass, we are committed to treating all Applicants and Associates fairly based on their abilities, achievements, and experience without regard to race, national origin, sex, age, disability, veteran status, sexual orientation, gender identity, or any other classification protected by law. Qualified candidates must be able to perform the essential functions of this position satisfactorily with or without a reasonable accommodation. Disclaimer: this job post is not necessarily an exhaustive list of all essential responsibilities, skills, tasks, or requirements associated with this position. While this is intended to be an accurate reflection of the position posted, the Company reserves the right to modify or change the essential functions of the job based on business necessity. *Los Angeles applicants: Compass Group will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box ordinance). Req ID: 1036132"},
{"title": "IT Liaison - Research - Remote", "link": "https://de.jobsyn.org/A0705A68095541139CD1B10C5E1721F288", "organization": "Mayo Clinic", "city": "Rochester", "region": "Minnesota", "country": "United States", "posted_date": "2022-06-22T04:09:24-04:00", "description": "Why Mayo Clinic Mayo Clinic is the nation's best hospital (U.S. News & World Report, 2021-2022) and ranked #1 in more specialties than any other care provider. We have a vast array of opportunities ranging from Nursing, Clinical, to Finance, IT, Administrative, Research and Support Services to name a few. Across all locations, you’ll find career opportunities that support diversity, equity and inclusion. At Mayo Clinic, we invest in you with opportunities for growth and development and our benefits and compensation package are highly competitive. We invite you to be a part of our team where you’ll discover a culture of teamwork, professionalism, mutual respect, and most importantly, a life-changing career! Mayo Clinic offers a variety of employee benefits. For additional information please visit Mayo Clinic Benefits (https://jobs.mayoclinic.org/benefits/) . Eligibility may vary. Position description The Information Systems Liaison has primary responsibility for the implementation of research applications and ensuring that software developed meets users' needs across the three Mayo campuses. As the liaison between research applications and end user personnel, incumbents lead and/or participate in work groups/project forums and serve on multiple committees related to research projects utilizing their in-depth knowledge of research processes and specified applications to ensure clear communication between all involved. Other key responsibilities include providing input and support for process/workflow analysis, design, development, maintenance, and enhancement of multiple applications. Qualifications This position requires a Bachelor's Degree in business, healthcare or related field with 5 years experience in a research/IT/business administration setting OR 8 years of experience in a research setting/IT/Business Administration. A comprehensive understanding of research practice and data flow throughout a large healthcare institution. Experience in multiple research functions within a large healthcare institution. Must be assertive and possess excellent interpersonal and oral communication skills (presentation, negotiation, and persuasion skills). Strong writing skills (presentations, proposals, reports, minutes) are required in order to document and communicate project activity. Time management and organizational skills, along with the ability to make quick and concise decisions are required to effectively carry out job responsibilities. Must be able to facilitate others in a team setting, work through difficult issues and bring groups to consensus. The applicant must have the knowledge of the research practice and research applications in order to develop process flow requirements and, in turn, implement these requirements into existing practice sites. Experience with word processing tools, database tools, spreadsheet, and presentation packages is required. Must be flexible to work in a variety of work environments (i.e., ambiguous, structured, consensus driven). Typically six months to one year orientation and on-the-job experience is required to obtain a detailed understanding of the assigned research applications and a broad overall knowledge of the designated area's applications which are necessary to function at a fully competent level. Visa sponsorship is not available for this position. Mayo Clinic does not participate in the F-1 STEM OPT extension program. Additional qualifications Supervisory experience. Demonstrated skills in project management facilitation, leadership, time management and education. Handles multiple complex projects across oversight groups. Exemption status Non-exempt Compensation Detail $22.24 - $31.67 / hour Benefits eligible Yes Schedule Full Time Hours / Pay period 80 Schedule details Monday through Friday, 8-4:30 CT This position is 100% remote, employees can work from anywhere in the United States. Weekend schedule N/A Remote Yes International Assignment No Site description Mayo Clinic is located in the heart of downtown Rochester, Minnesota, a vibrant, friendly city that provides a highly livable environment for more than 34,000 Mayo staff and students. The city is consistently ranked among the best places to live in the United States because of its affordable cost of living, healthy lifestyle, excellent school systems and exceptionally high quality of life. Recruiter Jill Squier EOE As an Affirmative Action and Equal Opportunity Employer Mayo Clinic is committed to creating an inclusive environment that values the diversity of its employees and does not discriminate against any employee or candidate. Women, minorities, veterans, people from the LGBTQ communities and people with disabilities are strongly encouraged to apply to join our teams. Reasonable accommodations to access job openings or to apply for a job are available. As an Affirmative Action and Equal Opportunity Employer Mayo Clinic is committed to creating an inclusive environment that values the diversity of its employees and does not discriminate against any employee or candidate. Women, minorities, veterans, people from the LGBTQ communities and people with disabilities are strongly encouraged to apply to join our teams. Reasonable accommodations to access job openings or to apply for a job are available. Equal opportunity As an Affirmative Action and Equal Opportunity Employer Mayo Clinic is committed to creating an inclusive environment that values the diversity of its employees and does not discriminate against any employee or candidate. Women, minorities, veterans, people from the LGBTQ communities and people with disabilities are strongly encouraged to apply to join our teams. Reasonable accommodations to access job openings or to apply for a job are available."},
{"title": "Clinical Trials Specialist", "link": "https://de.jobsyn.org/009A3A25617341DCBCE6B8E623BDCA4188", "organization": "Actalent", "city": "Basking Ridge", "region": "New Jersey", "country": "United States", "posted_date": "2022-06-22T02:32:37-04:00", "description": "IMMEDIATE NEED for Clinical Trial Specialist to join multi-billion dollar biopharmaceutical company long term! Description: Clinical Study Specialist (CSS) provides technical and administrative support to the clinical study team(s) responsible for clinical trial execution. Assigned to support the execution of one or more studies across a program. Support internally sourced studies and studies out-sourced to Clinical Research Organizations (CROs). • Organizes and delivers reports and metrics • Schedules and coordinates meetings, prepares agendas, presentation materials and minutes for clinical study team meetings and other study related meetings • Collates data for assessments such as feasibility and site selection and reviews site usability database • Contributes to review of study documents such as informed consent forms, case report forms and facilitates study document reviews per company standard operating procedures • Compiles study manuals including but not limited to: study reference binders and manuals and maintains versioning of study reference materials (e.g., regulatory, pharmacy, and laboratory binders • Collates materials for training and investigator meetings • Tracks site activation, enrollment and monitoring visits to projected plans, and escalate any issues or delays with site activation or deviations from monitoring plan • Monitors and updates investigator/site status for the trial, and supports with clinical trial registry postings Additional Skills & Qualifications: 3+ Years of Clinical Trial Experience (Pharma/Biotech or CRO only) 2+ years of managing Trial Master File 2+ Experience supporting CTMs on CRO management 2+ years of Taking Meeting Minutes Bachelors Degree minimum Additional Benefits Hybrid Flexibility Access to Benefits: Medical, Vision, Dental, 401(k) PTO & Holiday Pay About Actalent: Actalent connects passion with purpose. Our scalable talent solutions and services capabilities drive value and results and provide the expertise to help our customers achieve more. Every day, our experts around the globe are making an impact. We’re supporting critical initiatives in engineering and sciences that advance how companies serve the world. Actalent promotes consultant care and engagement through experiences that enable continuous development. Our people are the difference. Actalent is an operating company of Allegis Group, the global leader in talent solutions. The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law."},
{"title": "Retail Sales – Part Time", "link": "https://de.jobsyn.org/53CB38DAF6894238A2122EC61A9B38D788", "organization": "Lowe's", "city": "Daphne", "region": "Alabama", "country": "United States", "posted_date": "2022-06-22T01:54:58-04:00", "description": "We are happy you have taken time out of your day to check out this Retail Sales Associate opportunity with Lowe's. Do any of the following statements match your current goals? o I'm at least 18 years old, and I want to share my whole self in an inclusive work environment o I want to work for a company who welcomes and appreciates the military community o I'm retired, but I still want to work part-time or full-time o I currently have a job and need supplementary income o I want to build a career with a company that doesn’t require a four-year degree o I'm a stay-at-home parent, ready to return to work o I need flexibility in my schedule because I have children or other responsibilities o I'm interested in debt-free education, tuition reimbursement, or certificate programs o I want to learn a skilled trade and possibly start my own company o I am bilingual o I love DIY projects Whatever your need for employment, we at Lowe's believe we can help you build a better life and career, and we are all-in to help you achieve your goals. We are hiring immediately for this role, so make sure you apply today. Here's what you will do in this role: As a Lowe's Retail Sales Associate – Part-Time , you are the key to our customers' positive shopping experiences. You will be the smiling person who greets customers as they enter our doors or shop our aisles. You will engage customers regarding the types of projects they are working on and how you may help. You will guide shoppers to the right products or introduce them to the appropriate sales specialist who can assist. As you learn more about your department and Lowe's, you will understand which products naturally go together. It will be your responsibility to ensure that you share this knowledge with your customers. Here's an example: If a customer is looking for a lamp, do they need a shade? What about light bulbs? See, it's that simple! Lowe's offers jobs for people who aren't interested in sitting behind a desk for hours. Instead of answering phones, you might be in the store or the garden center, walking, talking to our customers, watering plants, and restocking items. Depending on your department, some lifting (building materials, paint, or maybe mulch) may be required with or without assistance. What's in It for You? Beyond the chance to make a difference for customers and teammates, each day will allow you to learn, grow, and celebrate wins together with your Lowe's team. Our associates enjoy the following benefits: • A 10% discount on everything at Lowe's • Eligible for debt-free education and skilled trade programs (https://lowes.guildeducation.com/partner?auth_redirect=true) • Access to comprehensive physical, mental, and financial benefits (https://benefitspricing.com/lowes/2022/index.html) * • Opportunity to earn quarterly bonuses • Flexible schedules to fit your lifestyle • Career growth—over 50% of our leaders started as hourly associates Your Day at Lowe's • Deliver excellent customer service • Help customers find products and provide recommendations • Help load customer merchandise • Restock merchandise Requirements • Be able to lift up to 25lbs. unassisted, or over 25lbs assisted. • Possess 6 months experience operating common retail technology, smartphones, tablets, or computers. • For individuals with disabilities who would like to request an accommodation, email HRServiceCenter@lowes.com. Bilingual applicants are encouraged to apply. Benefits offerings change each year and eligibility varies. For the most up-to-date breakdown of what's available to you, visit MyLowesBenefits.com. Lowe's adheres to CDC cleanliness and social distancing guidelines. Learn more at: lowes.com/l/safe.html (https://www.lowes.com/l/about/safe) Bilingual, Military, and Veteran applicants are encouraged to apply. EEO Statement Lowe's is an equal opportunity employer and administers all personnel practices without regard to race, color, religious creed, sex, gender, age, ancestry, national origin, mental or physical disability or medical condition, sexual orientation, gender identity or expression, marital status, military or veteran status, genetic information, or any other category protected under federal, state, or local law."},
{"title": "Director People Analytics", "link": "https://de.jobsyn.org/AA6987EA6714433F9B2C4D872C80616B88", "organization": "Highmark Health", "city": "Augusta", "region": "Maine", "country": "United States", "posted_date": "2022-06-22T01:17:39-04:00", "description": "Company : Highmark Health Job Description : JOB SUMMARY This job is accountable for leading the vision, strategy, development, and execution of analytics and reporting solutions that enable Highmark Health to address strategic priorities aligned to our people as a core investment for transforming the way we work to reinvent health . The incumbent will collaborate with HR and other business stakeholders to ensure alignment of analytics with Highmark Health's strategic talent priorities, plans and resources. The incumbent will lead, develop and manage analytics teams responsible for delivering actionable employee and workforce insights leveraging HR and business data; managing prioritization of demands and delivery; create and oversee execution of project plans and timelines; coach and monitor teams' performance; and anticipate and mitigate risks. ESSENTIAL RESPONSIBILITIES Perform management responsibilities to include, but are not limited to: involved in hiring and termination decisions, coaching and development, rewards and recognition, performance management and staff productivity.Plan, organize, staff, direct and control the day-to-day operations of the department; develop and implement policies and programs as necessary; may have budgetary responsibility and authority. Facilitate the creation of analyses, metrics and reports that support the evaluation of outcome measures using all available HR and business data; Lead analytics teams to develop analyses, metrics and reporting to monitor strategic and operational goal progress focused and actionable reporting to key stakeholders Partner with HR and business leaders to provide thought leadership and strategic thinking for the structure of analytics initiatives for people strategy, through demonstrating both expertise and execution with robust analysis and HR and business data integration; Collaborate effectively with HR and business stakeholders to ensure analytics identify actionable improvement opportunities aligned with execution of organizational strategic talent priorities, plans and resources Develops and executes the vision for where and how the People Analytics team can bring sophisticated insights and best-in-class analytics by defining the strategic roadmap and execution plan Other duties as assigned or requested. EDUCATION Required Bachelor's Degree in Mathematics, Statistics, Business, Economics, Industrial Psychology, Organizational Psychology, or related field Substitutions 6 years of relevant work experience in lieu of a Bachelor's Degree Preferred Master's Degree in Mathematics, Statistics, Business, Economics, Industrial Psychology, Organizational Psychology, or related field EXPERIENCE Required 7 years of leading and managing analytics teams and providing support to senior and executive leadership 5 years in a management or leadership role 5 years of project leadership in a complex, matrixed environment 5 years with business intelligence, analytical software, systems, tools and processes using HR and business data Preferred None LICENSES or CERTIFICATIONS Required None Preferred None ​ SKILLS Demonstrated record of data-driven discovery, intense intellectual curiosity, and a passion for working with data to answer important questions about people strategy and workforce optimization Strong working knowledge of coding languages, relational databases, quantitative and qualitative analytic methodologies, advanced analytics and statistics Excellent communication and facilitation skills with project team members, stakeholders, executives, and external customers; exceptional written and oral presentation skills; proven ability to communicate interpersonally and technically with technical and non-technical, and internal and external audiences; and the ability to lead through influence Sophisticated knowledge of how organizations work and how to get things done through formal and informal channels Exhibition of perseverance through energy, drive and demonstrated success when resistance or setbacks are encountered In-depth understanding of and experience with both HR and business processes, and the ability to identify opportunities for improvement and develop solutions Demonstrated ability to lead matrixed teams of technical, HR, and business staff to achieve shared organizational objectives and strategic goals Language (Other than English): None Travel Requirement: 0% - 25% PHYSICAL, MENTAL DEMANDS and WORKING CONDITIONS Position Type Office-based Teaches / trains others regularly Occasionally Travel regularly from the office to various work sites or from site-to-site Rarely Works primarily out-of-the office selling products/services (sales employees) Never Physical work site required Yes Lifting: up to 10 pounds Constantly Lifting: 10 to 25 pounds Occasionally Lifting: 25 to 50 pounds Rarely Disclaimer: The job description has been designed to indicate the general nature and essential duties and responsibilities of work performed by employees within this job title. It may not contain a comprehensive inventory of all duties, responsibilities, and qualifications required of employees to do this job. Compliance Requirement : This job adheres to the ethical and legal standards and behavioral expectations as set forth in the code of business conduct and company policies. As a component of job responsibilities, employees may have access to covered information, cardholder data, or other confidential customer information that must be protected at all times. In connection with this, all employees must comply with both the Health Insurance Portability Accountability Act of 1996 (HIPAA) as described in the Notice of Privacy Practices and Privacy Policies and Procedures as well as all data security guidelines established within the Company’s Handbook of Privacy Policies and Practices and Information Security Policy. Furthermore, it is every employee’s responsibility to comply with the company’s Code of Business Conduct. This includes but is not limited to adherence to applicable federal and state laws, rules, and regulations as well as company policies and training requirements. Referral Level Payout 3 Highmark Health and its affiliates prohibit discrimination against qualified individuals based on their status as protected veterans or individuals with disabilities, and prohibit discrimination against all individuals based on their race, color, religion, sex, national origin, sexual orientation/gender identity or any other category protected by applicable federal, state or local law. Highmark Health and its affiliates take affirmative action to employ and advance in employment individuals without regard to race, color, religion, sex, national origin, sexual orientation/gender identity, protected veteran status or disability. Highmark Health and its affiliates prohibit discrimination against qualified individuals based on their status as protected veterans or individuals with disabilities, and prohibit discrimination against all individuals based on their race, color, age, religion, sex, national origin, sexual orientation/gender identity or any other category protected by applicable federal, state or local law. Highmark Health and its affiliates take affirmative action to employ and advance in employment individuals without regard to race, color, age, religion, sex, national origin, sexual orientation/gender identity, protected veteran status or disability. EEO is The Law Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled/Sexual Orientation/Gender Identity ( https://www.eeoc.gov/sites/default/files/migrated_files/employers/poster_screen_reader_optimized.pdf ) We endeavor to make this site accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact number below. For accommodation requests, please contact HR Services Online at HRServices@highmarkhealth.org California Consumer Privacy Act Employees, Contractors, and Applicants Notice Req ID: J208689"},
{"title": "Formulation Associate", "link": "https://de.jobsyn.org/73FE428C05FD436F89FEBC0BA5856C2F88", "organization": "Actalent", "city": "Groton", "region": "Connecticut", "country": "United States", "posted_date": "2022-06-22T02:32:38-04:00", "description": "Formulation Associate Job Opportunity! About the Company: This Formulation Associate role is an entry level role for someone looking for laboratory experience. This company has over 50,000 employees and growing in over 900 sites in 50 countries, and is one of the leading international laboratories and top biopharmaceutical companies worldwide. They are looking for someone with one to two years of formulations experience in a lab, as well as someone who wants to grow within a leading company. There is extensive room for growth within this large network. Candidates have the opportunity to start as soon as possible and are subject to very competitive pay rates. Come and join them! About Actalent: At Actalent, we specialize in placing skilled professionals into the right job opportunities to build their careers. We manage the hiring for the top Healthcare and Science opportunities throughout New York and Connecticut. We have multiple opportunities available within these fields, ranging from Registered Nurses, LPNs, and Medical Assistants, as well as Laboratory Technicians, Chemists, and Research and Development Associates. The companies we work with provide competitive pay, great benefits, and ample room for growth. These long term opportunities are with top Healthcare Providers and Laboratories in the Northeast! Each of these hiring managers will make an immediate hiring decision for the right candidate . Job Description: Preparation of prototype formulations (solutions, suspensions, tablets, capsules, powder blends, semi-solid dosage forms, sterile and non-sterile liquids) for exploratory studies in in-vitro and in-vivo models Development of oral, topical and intravenous (sterile) dosage forms for feasibility studies and small scale manufacturing operations Measurement of key active compound and formulation properties (such as solubility, tablet hardness, disintegration, pH, isotonicity, color, gelling tendency, etc.) Assessment of the chemical and physical stability of prototype formulations, as well as the performance of prototype formulations using in-vitro tests (non-sink dissolution, precipitation, etc.) Identifying potential stability and performance issues with prototype formulations Development of protocols for preparation of formulations at preclinical and clinical study sites Routine preparation of solution and suspension formulations for use in preclinical studies Skills & Qualifications: Bachelor’s or Master’s degree in Chemistry or other related degree concentration and 1 to 3 years of related experience At least one year experience in formulation development Previous experience with drug formulation and pre-formulation techniques, and an understanding of drug candidate properties Experience conducting routine laboratory experiments (e.g., HPLC, DSC, PXRD spectroscopy, solubility determinations, dissolution testing, suspension processing, etc.) in a timely and productive manner with consistent quality output Ability to follow procedures reliably and consistently and elevate relevant issues, as appropriate Strong computer, scientific, and organizational skills Adept in Microsoft office Excellent communication (oral and written) and attention to detail Ability to work independently and as part of a team, self-motivation, adaptability, and a positive attitude Ability to learn new techniques, perform multiple tasks simultaneously, keep accurate records, follow instructions, and comply with company policies Additional Skills: Formulation, Laboratory, Chemistry, R&d, Hplc, Gmp, Quality control, Pharmaceutical, Biology, Research & development, Powder coat, Chemical, Analytical chemistry *If you are not interested in this opportunity, we also hire for entry-level to mid-level roles for the following job opportunities: Research Assistants Research and Development Associates Chemists Biologists Quality Assurance Technicians Quality Control Technicians Specimen Processors and Accessioners Lab Assistants Lab Technicians Medical Technologists Certified Nursing Assistants Phlebotomists Medical Assistants Licensed Practical Nurses Registered Nurses Please reach out to me at this email to schedule a time to discuss what you are looking for in a new job opportunity! agosselin@actalentservices.com About Actalent: Actalent connects passion with purpose. Our scalable talent solutions and services capabilities drive value and results and provide the expertise to help our customers achieve more. Every day, our experts around the globe are making an impact. We’re supporting critical initiatives in engineering and sciences that advance how companies serve the world. Actalent promotes consultant care and engagement through experiences that enable continuous development. Our people are the difference. Actalent is an operating company of Allegis Group, the global leader in talent solutions. The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law."},
{"title": "HEMATOLOGY DISTRICT MANAGER", "link": "https://de.jobsyn.org/ADE2564F4AFE4BA48DE179964024130288", "organization": "J&J Family of Companies", "city": "Salvador", "region": null, "country": "Brazil", "posted_date": "2022-06-22T05:57:53-04:00", "description": "Na Johnson & Johnson, temos uma missão para mudar a trajetória da saúde para a humanidade. Isso começa com a criação da força de trabalho mais saudável do mundo. Através de programas e políticas de última geração, melhoramos a saúde física, mental, emocional e financeira de nossos funcionários e seus entes queridos. Como tal, dependendo da localização e sujeito à legislação local, os candidatos oferecidos podem ser obrigados a apresentar comprovante de vacinação COVID-19 ou, em determinados países, obter uma acomodação aprovada antes do início do emprego para apoiar o bem-estar de nossos funcionários, suas famílias e as comunidades em que vivemos e trabalhamos. Se você for convidado para uma entrevista para o cargo, seu recrutador irá te avisar sobre o requerimento da vacina em sua localização geográfica. Na Johnson & Johnson, a maior empresa de saúde do mundo, nos reunimos com um propósito: transformar a história da saúde humana. Diversidade e inclusão são essenciais para continuar construindo nossa história de pioneirismo e inovação, que tem impactado a saúde de mais de 1 bilhão de pacientes e consumidores todos os dias por mais de 130 anos. Independentemente de sua raça, crença, orientação sexual, religião ou qualquer outra característica, VOCÊ é bem-vindo em todas as posições abertas na maior empresa de saúde do mundo. Quando você se junta à Johnson & Johnson, sua mudança pode significar nosso próximo avanço. Na Janssen, estamos criando um futuro em que a doença é coisa do passado. Somos a empresa farmacêutica Johnson & Johnson, trabalhando incansavelmente para tornar o futuro uma realidade para pacientes em todo o mundo, lutando contra doenças com ciência, melhorando o acesso com astúcia e inovação e curando a desesperança com nossos corações. Focamos nas áreas da medicina onde podemos fazer a maior diferença: Cardiovascular e Metabolismo, Imunologia, Doenças Infecciosas e Vacinas, Neurociências, Oncologia e Hipertensão Pulmonar. Somos Janssen. Nossa missão nos impulsiona. Nossos pacientes nos inspiram. Colaboramos com o mundo pela saúde de todos. Visite: https://www.janssen.com/ para mais informações. Buscamos o melhor talento para a posição Gerente Distrital de Hematologia que ficará localizada em Salvador / Recife / Fortaleza / Brasília / Goiânia. Propósito: Responsabilidades principais: • Garantir que os valores éticos, os guidelines globais de compliance da organização e legislações nacionais estejam presentes e praticados em todas a decisões e ações ao qual esteja envolvido ou tenha conhecimento, relacionados ou não as suas responsabilidades na função. • Liderar o time de forma positiva e motivadora, desafiando e reconhecendo de maneira justa, utilizando os conceitos de meritocracia e transparência, buscando fomentar um clima de conquista e realização. • Garantir e acompanhar a implementação com excelência das estratégias e planos de ação da unidade de negócios definidas para cada ciclo ou total do ano. • Analisar os indicadores de mercado, performance, execução e financeiros da sua área, visando aprimorar a eficácia e eficiência do time, como também identificar risco, desvios e oportunidades. • Elaborar junto ao time, planos e estratégias de curto/médio/longo prazos para atendimento dos objetivos de vendas e KPIs propostos, acompanhando os ciclos de vendas. • Cultivar relacionamento estratégico com os principais KOLs e Stakeholders importantes para o negócio. Bem como desenvolver novos líderes. • Participar ativamente do CVT de Campo, responsabilizando-se do acompanhamento de todos os processos e projetos que envolve os produtos aos quais trabalha. • Atrair profissionais com potencial de crescimento na Cia. • Elaborar e garantir execução dos planos de desenvolvimento para os colaboradores do seu time. • Identificar talentos, tendo sempre como referência as características, competências e valores cultivados pela organização. • Buscar continuamente o autodesenvolvimento técnico e profissional Qualifications Requisitos: Formação superior completa - Conhecimento em informática (Pacote Office) - Indispensável possuir habilitação de condução categoria B - Desejável Pós-Graduação/MBA com foco em gestão de pessoas e negócios (será considerado um diferencial) - Alto nível de organização, planejamento e conhecimento em ferramentas utilizadas para análises e preparação de planos, incluindo o pacote Office - Experiência com gestão de pessoas - Inglês Intermediário - Disponibilidade para viagens 50 a 75% Competência técnica • Experiência na área comercial/marketing • Capacidade analítica avançada • Comunicação fluida, clara e dinâmica *Conhecimento no mercado de Especialidades, Doenças Raras, Oncologia. Experiência em Hematologia será um diferencial. Requisitos de Frota Segura (Safe Fleet): Como esta posição é elegível a um Carro da Frota como uma ferramenta de trabalho, é necessário: · Carteira de habilitação válida. · Pelo menos 3 anos de experiência dirigindo um carro, de preferência em áreas de autoestrada ou rodovias (entre 80 e 100 km/h) e com veículos padrão. Primary Location Brazil-Distrito Federal-Brasilia- Other Locations Latin America-Brazil-Pernambuco-Recife, Latin America-Brazil-Bahia-Salvador, Latin America-Brazil-Ceará-Fortaleza Organization Janssen Cilag Farmaceutica Ltda. (7585) Job Function Sales Requisition ID 2206046433W"},
{"title": "Restaurant Manager", "link": "https://de.jobsyn.org/A97832C473014C2A90270B5D55DBADEB88", "organization": "Taco Bell", "city": "Lanse", "region": "Michigan", "country": "United States", "posted_date": "2022-06-22T02:30:27-04:00", "description": "Be Your Best Self! See it, Own it, Crush it! Make Moments Count! Are you looking to master new skills, build meaningful relationships, and access limitless growth opportunities? We want you to be a part of our long-term success story and we're excited to meet you! We are looking for a Restaurant General Manager to train and motivate our team members to execute our processes with integrity and financial accountability, delivering against our high standards of Quality, Service, and Cleanliness. We treat our team right! ? Earn $50,000 - $55,000/year. ? Top Restaurant General Managers can earn up to an additional $20,000/year in bonuses. (paid monthly) ? Benefits (Medical, Dental, Vision, Teledoc, Short-Term Disability, Long-Term Disability) ? Paid Vacation ? Live Mas Scholarships ? Paid Sick Leave ? Special Discounts on insurance, groceries, travel, electronics, and more! ? Career Advancement - Area Coach, Market Leader! ? And More! By joining the Alvarado Restaurant Nation and Taco Bell Restaurants , you have the opportunity to become a top leader in the restaurant industry. ? Career development program: Your District Manager will provide mentorship and support. ? Take pride and ownership of a Taco Bell Restaurant. ? Develop your restaurant management experience. ? Grow into a District Manager and Market Leader in one of the fastest growing franchises in the U.S. What you bring to the Nation ? 1-2 years of leadership experience in the restaurant, retail, or hospitality industry. ? Must have a valid Driver's License and access to a vehicle. ? Outstanding Guest Service standards. ? Understanding of food quality and safety. Are you hungry for a challenge? Apply Today! At Alvarado Restaurant Nation, we're team players that embrace a \"Can Do, Will Do\" attitude! When you join The Nation, you join a family that encourages you to: ? Be Your Best Self while we provide you with a Great Place to Work. ? See it, Own it, Crush it with your passion and grit ? Make Moments Count by celebrating wins and appreciating the joys of life. You are applying for a position with a franchisee or licensee of Taco Bell, not Taco Bell Corp. or any of its affiliates. Franchisees and licensees are independent business organizations, who will be your only employer if hired, and who are responsible for their own employment practices, including setting their own wage and benefit programs."},
{"title": "Assistant General Manager", "link": "https://de.jobsyn.org/4F8C5E8621C74C83814634A72109010988", "organization": "Taco Bell", "city": "Huntington Park", "region": "California", "country": "United States", "posted_date": "2022-06-22T01:28:53-04:00", "description": "Be Your Best Self! See it, Own it, Crush it! Make Moments Count! Are you looking to master new skills, build meaningful relationships, and access limitless growth opportunities? We want you to be a part of our long-term success story and we're excited to meet you! We are looking for an Assistant General Manager to train and motivate our team members to execute our processes with integrity and financial accountability, delivering against our high standards of Quality, Service, and Cleanliness. We treat our team right! ? Competitive Base Pay ? Top Shift Leaders can earn up to an additional $4,390/year in bonuses. (paid monthly) ? Benefits (Medical, Dental, Vision, Teledoc, Short-Term Disability, Long-Term Disability) ? Paid Vacation ? Career Advancement - Restaurant General Manager, Area Coach, Market Leader! ? Live Mas Scholarships ? Paid Sick Leave ? Special Discounts on insurance, groceries, travel, electronics, and more! ? And More! By joining the Alvarado Restaurant Nation and Taco Bell Restaurants , you have the opportunity to become a top leader in the restaurant industry. ? Career development program: Your District Manager will provide mentorship and support. ? Take pride and ownership of a Taco Bell Restaurant. ? Develop your restaurant management experience. ? Grow into a District Manager and Market Leader in one of the fastest growing franchises in the U.S. What you bring to the Nation ? 1+ years of leadership experience in the restaurant, retail, or hospitality industry. ? Must have a valid Driver's License and access to a vehicle. ? Outstanding Guest Service standards. ? Understanding of food quality and safety. Are you hungry for a challenge? Apply Today! At Alvarado Restaurant Nation, we're team players that embrace a \"Can Do, Will Do\" attitude! When you join The Nation, you join a family that encourages you to: ? Be Your Best Self while we provide you with a Great Place to Work. ? See it, Own it, Crush it with your passion and grit ? Make Moments Count by celebrating wins and appreciating the joys of life. You are applying for a position with a franchisee or licensee of Taco Bell, not Taco Bell Corp. or any of its affiliates. Franchisees and licensees are independent business organizations, who will be your only employer if hired, and who are responsible for their own employment practices, including setting their own wage and benefit programs."},
{"title": "Social Worker - Licensed", "link": "https://de.jobsyn.org/00DB17E786DA49CAADF6299B94EBD6CC88", "organization": "ProMedica Health System", "city": "Sewell", "region": "New Jersey", "country": "United States", "posted_date": "2022-06-22T01:33:22-04:00", "description": "ProMedica Senior Care, formerly HCR Manor Care, provides a range of services, including skilled nursing care, assisted living, post-acute medical and rehabilitation care, hospice care, home health care and rehabilitation therapy. The Social Worker is responsible to provide medically related social work services so that each resident may attain or maintain the highest practicable level of physical, mental, and psychosocial well-being. In return for your expertise, you will enjoy excellent training, industry-leading benefits and unlimited opportunities to learn and grow. Be a part of the team leading the nation in healthcare. 619 - ProMedica Skilled Nursing and Rehabilitation - Washington Township, NJ Two years of social work supervised experience working directly with geriatric clients in a health care setting, desirable. Equal Opportunity Employer Qualified applicants will receive consideration for employment without regard to race, color, national origin, ancestry, religion, sex/gender (including pregnancy), sexual orientation, gender identity or gender expression, age, physical or mental disability, military or protected veteran status, citizenship, familial or marital status, genetics, or any other legally protected category. In compliance with the Americans with Disabilities Act Amendment Act (ADAAA), if you have a disability and would like to request an accommodation in order to apply for a job with ProMedica Senior Care, please contact jobline@hcr-manorcare.com."},
{"title": "Market Financial Center Manager - Central Maryland Market - Hanover, MD", "link": "https://de.jobsyn.org/F87C4F4E05324CB9ADAF2E0D796718BC88", "organization": "Bank of America", "city": "Hanover", "region": "Maryland", "country": "United States", "posted_date": "2022-06-22T04:28:37-04:00", "description": "Market Financial Center Manager - Central Maryland Market - Hanover, MD Hanover, Maryland Job Description: Primary Responsibilities General Management Responsible for building client traffic, engaging and appropriately routing clients and client retention; Responsible for the general look, feel and attractiveness of the center, ensuring space is leveraged to accommodate clients; Responsible for maintaining camaraderie amongst center associates, while ensuring all teammates drive collectively toward financial center goals; Ensure that the FCM/Market Leader directives are continued in the absence of the FCM; Participate in market-level initiatives, as prescribed by market leaders Risk Management and Operational Excellence Drive operational excellence by engaging staff on business strategy and performance results; Execute risk and service delivery strategy, and evaluate key performance indicators to identify opportunities for improvement; Emphasize the need to exceed metrics while also focusing on long-term strategies and goals; Adhere to and enforce internal and regulatory policies, procedures and processes; Proactively identify and manage risk in business, product and service transactions; Monitor client-calling activities and ensure we develop the proper client engagement; Successfully resolve customer issues and escalations in a timely and professional manner; Responsible for associate and customer safety Client Experience & Revenue Growth Foster a client-centric environment whereby associates are accountable for delivering an exceptional customer experience and exceeding customer experience metrics; Lead the lobby and choreography of customer traffic including direct routing of customers to specialists to help drive overall “One Team” revenue growth; Ensure all appointments are assigned to the appropriate financial center associate; Drive client relationship management and assist with sales and sales leadership Understand the drivers of, and opportunities to enhance, client satisfaction in the center; Ensure tight connection with the market lead and other “One Team” leaders/partners; Service customers using self-service technologies, such as ATMs, online banking or mobile banking; Hold associates accountable to deliver against our revenue strategy Talent Management Responsible for oversight of associates in the center; Observe, model and coach the financial center team on proper execution of risk and service strategy; Personally invest in talent through interviewing and hiring service and operational associates, where needed; Ensure training is completed on time, and continue investment in ongoing education; Drive associate performance through active and continuous coaching, continued education and performance plans Required skills: A minimum of three years recent experience building, leading, managing and coaching a team A minimum of three years recent experience building, leading, managing and coaching a team Demonstrated ability to influence and collaborate with others outside of reporting authority to achieve shared goals Proven customer service skills and the ability to resolve problems independently or escalate as needed to promote customer satisfaction Strong financial and business acumen including experience in leading managers and interpreting financial reports to drive profitability Proven record of balancing risk and making sound decisions while achieving business goals Strong interpersonal skills, including the ability to easily engage others in dialogue, convey sincere interest in building/deepening relationships, and demonstrate a commitment to providing personalized service Strong organizational skills including the ability to manage multiple responsibilities, prioritize and delegate while delivering results Strong communication skills (including verbal, non-verbal, written and presentation) and active listening skills Proficiency in computer skills and professional programs (for example, Microsoft Office) Ability to pass pre-employment assessments and compliance requirements Availability to work weekends and/or extended hours as required to run the business Must be able to travel to any financial center within the defined market Desired Skills Undergraduate degree Bilingual (fluent verbal and written) Experience in the following industries: Consumer banking/financial services, mortgage, retail or hospitality Job Band: H5 Shift: 1st shift (United States of America) Hours Per Week: 40 Weekly Schedule: Referral Bonus Amount: 0 Job Description: Primary Responsibilities General Management Responsible for building client traffic, engaging and appropriately routing clients and client retention; Responsible for the general look, feel and attractiveness of the center, ensuring space is leveraged to accommodate clients; Responsible for maintaining camaraderie amongst center associates, while ensuring all teammates drive collectively toward financial center goals; Ensure that the FCM/Market Leader directives are continued in the absence of the FCM; Participate in market-level initiatives, as prescribed by market leaders Risk Management and Operational Excellence Drive operational excellence by engaging staff on business strategy and performance results; Execute risk and service delivery strategy, and evaluate key performance indicators to identify opportunities for improvement; Emphasize the need to exceed metrics while also focusing on long-term strategies and goals; Adhere to and enforce internal and regulatory policies, procedures and processes; Proactively identify and manage risk in business, product and service transactions; Monitor client-calling activities and ensure we develop the proper client engagement; Successfully resolve customer issues and escalations in a timely and professional manner; Responsible for associate and customer safety Client Experience & Revenue Growth Foster a client-centric environment whereby associates are accountable for delivering an exceptional customer experience and exceeding customer experience metrics; Lead the lobby and choreography of customer traffic including direct routing of customers to specialists to help drive overall “One Team” revenue growth; Ensure all appointments are assigned to the appropriate financial center associate; Drive client relationship management and assist with sales and sales leadership Understand the drivers of, and opportunities to enhance, client satisfaction in the center; Ensure tight connection with the market lead and other “One Team” leaders/partners; Service customers using self-service technologies, such as ATMs, online banking or mobile banking; Hold associates accountable to deliver against our revenue strategy Talent Management Responsible for oversight of associates in the center; Observe, model and coach the financial center team on proper execution of risk and service strategy; Personally invest in talent through interviewing and hiring service and operational associates, where needed; Ensure training is completed on time, and continue investment in ongoing education; Drive associate performance through active and continuous coaching, continued education and performance plans Required skills: A minimum of three years recent experience building, leading, managing and coaching a team A minimum of three years recent experience building, leading, managing and coaching a team Demonstrated ability to influence and collaborate with others outside of reporting authority to achieve shared goals Proven customer service skills and the ability to resolve problems independently or escalate as needed to promote customer satisfaction Strong financial and business acumen including experience in leading managers and interpreting financial reports to drive profitability Proven record of balancing risk and making sound decisions while achieving business goals Strong interpersonal skills, including the ability to easily engage others in dialogue, convey sincere interest in building/deepening relationships, and demonstrate a commitment to providing personalized service Strong organizational skills including the ability to manage multiple responsibilities, prioritize and delegate while delivering results Strong communication skills (including verbal, non-verbal, written and presentation) and active listening skills Proficiency in computer skills and professional programs (for example, Microsoft Office) Ability to pass pre-employment assessments and compliance requirements Availability to work weekends and/or extended hours as required to run the business Must be able to travel to any financial center within the defined market Desired Skills Undergraduate degree Bilingual (fluent verbal and written) Experience in the following industries: Consumer banking/financial services, mortgage, retail or hospitality Shift: 1st shift (United States of America) Hours Per Week: 40 Learn more about this role Full time JR-22057228 Band: H5 Manages People: No Travel: Yes, 75% of the time Manager: Talent Acquisition Contact: JENNIFER FRISCH Referral Bonus: 500 Bank of America and its affiliates consider for employment and hire qualified candidates without regard to race, religious creed, religion, color, sex, sexual orientation, genetic information, gender, gender identity, gender expression, age, national origin, ancestry, citizenship, protected veteran or disability status or any factor prohibited by law, and as such affirms in policy and practice to support and promote the concept of equal employment opportunity and affirmative action, in accordance with all applicable federal, state, provincial and municipal laws. The company also prohibits discrimination on other bases such as medical condition, marital status or any other factor that is irrelevant to the performance of our teammates. To view the \"EEO is the Law\" poster, CLICK HERE (https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf) . To view the \"EEO is the Law\" Supplement, CLICK HERE (https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf) . Bank of America aims to create a workplace free from the dangers and resulting consequences of illegal and illicit drug use and alcohol abuse. Our Drug-Free Workplace and Alcohol Policy (“Policy”) establishes requirements to prevent the presence or use of illegal or illicit drugs or unauthorized alcohol on Bank of America premises and to provide a safe work environment. To view Bank of America’s Drug-free workplace and alcohol policy, CLICK HERE ."},
{"title": "SPP Analytics Associate", "link": "https://de.jobsyn.org/217D3190DA9D47DF97237A93A05C8EF088", "organization": "Accenture", "city": "Manila", "region": null, "country": "Philippines", "posted_date": "2022-06-22T03:39:32-04:00", "description": "Sales & Pricing Performance provides end-to-end sales and pricing effectiveness, sales operations, and analytics services. S&PP partners with teams around the world to deliver insights, improve acumen and win profitable deals. • Graduate of any Bachelor's Degree • At least 6 years of experience, which include: working alongside leadership and coaching a remotely located team, balancing requests • At least 4 years of experience in MS Excel • At least 2 years of experience in creating leadership-ready analysis • At least 2 years of experience in Analytics and in Sales, Pricing, Finance, or related field Bonus points if you have: • Understanding of Accenture sales process and systems, business model • at least 2 years of work experience using MMS (salesforce), MMB, Qlik, Tableau, PowerBI"},
{"title": "Sirius Portal Administrator - Maintenance Contract Analyst", "link": "https://de.jobsyn.org/294A2861278B4B3EADC8DF9EAC943C7C88", "organization": "Sirius Computer Solutions", "city": "Helena", "region": "Montana", "country": "United States", "posted_date": "2022-06-22T05:06:17-04:00", "description": "CDW is an equal opportunity/affirmative action employer committed to a diverse and inclusive workplace. If you need assistance in applying for a position, please complete our accommodation request form. (https://www.cdw.com/content/cdw/en/landing-pages/accessibility-request.html) Home / Job Search /Sirius Portal Administrator - Maintenance Contract Analyst Sirius Portal Administrator - Maintenance Contract Analyst at CDW Careers Job ID: 22003078 Focus Area: Data Security Date Posted Jun 21, 2022 Location: Remote, Remote Employment Type: Full-Time Sirius Computer Solutions is a CDW company. We share common values as a performance-driven, customer-focused culture. CDW is a leading multi-brand provider of information technology solutions to business, government, education and healthcare customers across the globe. The primary purpose for this position is to oversee the integrity of information in the maintenance/asset management tool. The role requires a client service-oriented individual who possesses a high degree of written and verbal communication skills, attention to detail and the ability to foster teamwork, as well as work effectively as an individual team member. This position will be responsible for the daily operations, maintenance and enhancement of the maintenance/asset management tool. Attention to detail combined with efficient, first time quality work are key requirements to success in the Portal Administrator role. Primary Duties & Responsibilities Upload contract details daily to ensure data quality for our clients. Analyze and validate large amounts of data in Excel on a daily basis. Create and modify standard sales reports on an as needed basis which details user information, client information and contract expirations information. Oversee the functionality of the maintenance/asset management tool and work with IT and Management to resolve any systematic issues Add new internal and external users to the maintenance/asset management tool. Work independently with internal resources and external partners to address and resolve questions/issues with regards to client information in the maintenance/asset management tool. Offer enhancement recommendations and help implement new enhancements to the maintenance/asset management tool. Participate in the develop of training plans and conduct training sessions for new team member on boarding, or continuing education for existing team members on the maintenance/asset management tool. Assist in documenting policy/procedures and established standard practices for the maintenance/asset management tool. Basic Qualifications High school diploma or equivalent At least 1 year of work experience in a sales support, administrative, or similar role that involves working with IT hardware, software, and/or maintenance contracts Demonstrated skills in Microsoft Office (Word, PowerPoint, Outlook, etc.), to include the ability to use different formulas and filters to analyze data in Excel Other Position Requirements Ability to analyze and define quality assurance metrics Skills in comprehension and interpretation of technical product information Demonstrated written and verbal communication skills Skills in Critical Thinking and Problem Solving Demonstrated organizational, time management, multitasking and prioritization skills with the ability to re-prioritize work as needed. Demonstrated ability to adapt to and embrace change with composure, resilience, and perseverance in the face of constraints, high pressure, and adverse situations. Ability to adapt in a dynamic and always changing environment Ability to perform work requiring a high level of attention to detail Effective/efficient data entry skills Preferred Qualifications Bachelor’s degree in Business Administration or a related field 3 years of IT industry experience, to include working with IT hardware, software, and/or maintenance contracts Data Privacy and Security: All Sirius employees are responsible to safeguard the information and information systems that they use or handle in the execution of their duties. Employees are obligated to know and perform their duties in accordance with Sirius policies, standards, and procedures related to security and report security violations to the appropriate Sirius authority. Participate at hire and annually in the Information Security Awareness training as well as other required training identified by the Human Resources department.  Other data privacy and data security related regulatory training may be required based on your role or assignment. The above primary duties, responsibilities, and position requirements are not all inclusive COVID-19 Update: CDW is committed to maintaining a workplace that is free of known hazards and to ensuring the safety, health, and well-being of coworkers and candidates for employment and their families, as well as the community. CDW requires all coworkers be fully vaccinated against COVID-19, with the only exceptions being a documented, legally required medical or religious accommodation. Prior to starting with CDW, successful candidates will be required to: (i) be fully vaccinated against COVID-19 and provide CDW with proof of full vaccination; or (ii) apply for and receive a medical or religious-based accommodation to be exempt from the mandatory vaccination policy."},
{"title": "Desktop Support Technician", "link": "https://de.jobsyn.org/6FAB045BFE3245AB9B5DDC712A8003A888", "organization": "TEKsystems", "city": "Mooresville", "region": "North Carolina", "country": "United States", "posted_date": "2022-06-22T03:08:02-04:00", "description": "TEKsystems is looking for Desktop Support technician for one of our top clients in the Davidson, NC area. They offer stability, growth, updated technology and more. See the top skills & job description below. Top Skills 1) 3 - 5 years experience providing desk side and remote support for hardware/software issues for minimum 1000 end users 2) Minimum 3 yr of troubleshooting MS Win 7/10, MS Office 3) Experience with desktop workstation set-ups Job Duties: Individual will be knowledgeable of all current Windows operating systems. (Windows 7/10 skills) Basic Windows troubleshooting will be involved. Execute service delivery by performing: Remote support, primarily responding to trouble tickets over the phone Coordinates with Client End User on expectations and availability to conduct Managed Client Services. Identifies potential issues that could adversely impact End User experience and follows through on action steps. Utilizes advanced tools /technical knowledge to remediate customer problems and conduct scheduled installs. -Inventory management PREFERRED SKILLS: - Windows 10 experience - Dell hardware, Scanners, Mobile devices Skills: desktop hardware, desktop, software, mobile device, Top Skills Details: desktop hardware, desktop software ,mobile device, network, scanners About TEKsystems: We're partners in transformation. We help clients activate ideas and solutions to take advantage of a new world of opportunity. We are a team of 80,000 strong, working with over 6,000 clients, including 80% of the Fortune 500, across North America, Europe and Asia. As an industry leader in Full-Stack Technology Services, Talent Services, and real-world application, we work with progressive leaders to drive change. That's the power of true partnership. TEKsystems is an Allegis Group company. The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law. We are an equal opportunity employers and will consider all applications without regard to race, genetic information, sex, age, color, religion, national origin, veteran status, disability or any other characteristic protected by law. To view the EEO is the law poster click here. Applicants with disabilities that require an accommodation or assistance a position, please call 888-472-3411 or email mpowers@teksystems.com. This is a dedicated line designed exclusively to assist job seekers whose disability prevents them from being able to apply online. Messages left for other purposes will not receive a response."},
{"title": "Nurse Aide I/Clin Secretary - Mother/Baby, Cary (supplemental)", "link": "https://de.jobsyn.org/C6483B2630014C9EB70FD7A4302F594F88", "organization": "WakeMed Health & Hospitals", "city": "Raleigh", "region": "North Carolina", "country": "United States", "posted_date": "2022-06-22T01:19:45-04:00", "description": "About WakeMed: WakeMed Cary Hospital provides exceptional patient care to the residents of Cary, N.C., and the surrounding area. This full-service community hospital has 178 inpatient beds and is part of the WakeMed Health & Hospitals system. The only hospital in western Wake County, Cary Hospital offers an array of services including: surgical services; Women's Pavilion & Birthplace; intensive care; general medical and surgical nursing care; telemetry monitoring unit; cardiac and vascular catheterization labs; centers for advanced gastrointestinal, chest pain and sleep; inpatient rehab and outpatient specialty rehab services; and outpatient ancillary services. Additionally, the hospital’s 24-hour emergency department is backed by WakeMed Children's Hospital and Wake County's only Level I WakeMed Trauma Center in Raleigh. Cary Hospital is accredited by The Joint Commission, certified by The Joint Commission as an Advanced Primary Stroke Center and has received accreditation in Chest Pain from the American College of Cardiology. WakeMed Cary Hospital is accredited as a Comprehensive Center for bariatric surgery by the American College of Surgeons (ACS) Metabolic and Bariatric Surgery Accreditation and Quality Improvement Program (MBSAQIP), in partnership with the American Society for Metabolic and Bariatric Surgery (ASMBS). WakeMed Health & Hospitals is headquartered in Raleigh, N.C., which is ranked nationally as one of the top 10 best places to live for quality of life and is located just two hours from the beach or three from the mountains. The area has been named one of the fastest growing areas in the country and is located just minutes from the famous Research Triangle Park. As an Equal Opportunity Employer, WakeMed provides an inclusive work environment that promotes the valuing of differences, respect for people and cooperativeness among our diverse workforce. WakeMed does not discriminate against any employee or applicant in any terms or conditions of employment. All applicants/employees are considered for employment, transfer, promotion or training without regard to race, religion, color, gender, gender identity/expression, genetics, sexual orientation, age, pregnancy, national origin, disability or veteran status. Position Information: The Nurse Aide I/Clinical Secretary provides appropriate secretarial support to patients/families and professional staff to ensure efficient customer oriented service delivery. The Nurse Aide I/Clinical Secretary actively supports and incorporates WakeMed's Patient & Family Centered Care (PFCC) model by delivering patient care under the direction of the Registered Nurse. The four key concepts of PFCC are: Dignity and Respect = Listen to and honor patient and family perspectives and choices; Information Sharing = Communicate and share complete and unbiased information with patients and families in ways that are affirming and useful; Participation = Patients and families are encouraged and supported in participating in care and decision-making at the level they choose; Collaboration = Patients and families and the Nurse Aide I/Clinical Secretary collaborate in the delivery of care. The Nurse Aide I/Clinical Secretary understands the needs of the organization and supports the mission, vision, values, and aspirational goals. Experience Requirements: 1 Year Healthcare Preferred Education Required: High School Diploma or Equivalent Required - Or College Courses Nurse Aide Required Licensure/Certification Requirements: Nurse Aide I Required Hours of Work: rotating Weekend Requirements: As Needed Call Requirements: none"},
{"title": "Help Desk", "link": "https://de.jobsyn.org/64CFD6D25CBB4A2F808024A6F68816BF88", "organization": "TEKsystems", "city": "Orlando", "region": "Florida", "country": "United States", "posted_date": "2022-06-22T03:08:05-04:00", "description": "Description: This person will be providing services to internal Hilton employees. They will work through incoming calls and emails. The will be creating tickets through servicenow. The main priority is first call resolution. The most common issues will be password resets and oracle questions. Position Statement: The Service Desk Technician is a highly motivated, passionate and detail oriented Customer Service advocate looking to learn and grow in a fast paced environment. This position will be a member of the Tier 1 Team, and will be the primary point person for all customers and ITG personnel, with the intent of resolving most customer related application and service issues during first contact. The candidate will be expected to interact with customers, peers, escalation Teams, and Leadership via phone, Instant Messenger, video, and email to ensure customer issues are resolved per approved Service Level Agreements (SLAs) metrics. This position is subject to shift work and a candidate will be expected to move to different shifts as needed. Position Summary: • Primary Point of Contact for Hilton Grand Vacations internal customer issues per approved SLA metrics. • Monitors the progress of Incidents and Problems, and provides timely updates to customers, Hilton Grand Vacations Information Technology personnel, and Hilton Grand Vacations Leadership Team. • Performs Best Practices application and systems diagnosis and troubleshooting techniques in other to resolve all service affecting issues. • Coordinates and escalates complex issues to the Escalation and Leadership Teams when necessary. • Works with peers and management to resolve technical issues. • Documents all communication in the Ticketing System, and updates customers regularly on active tickets. Required Qualifications • Technical School, University, or College education in a Technology Concentration. (Experience may be substituted for education). • Must have understanding with respect to monitoring, managing and maintaining local and remote customer applications and services. • Must have working knowledge of network and systems administration, and recommended troubleshooting techniques. • Ability to quickly and efficiently address customer needs by providing solutions to customer issues, or escalating to Escalation Team for prompt resolution. • Excellent verbal and written communications skills with ability to build relationships at all levels of the organization. • Must have a working understanding of the ITIL framework. • Energetic, responsible, self-motivated, and able to work in a Team environment under minimal supervision. • Exceptional Customer Service skills. • Keen attention to detail. • Able to effectively prioritize and perform Service Desk tasks in a fast paced environment. • Excellent analytical, organizational and technical skills. Skills: service desk, servicenow, active directory, password, troubleshoot, windows, remote, ticket Top Skills Details: service desk, servicenow, active directory, password, troubleshoot, windows, remote, ticket Additional Skills & Qualifications: Person must be professional, very well polished and well spoken. Lewis is very big on personality and willingness to learn. Experience Level: Entry Level About TEKsystems: We're partners in transformation. We help clients activate ideas and solutions to take advantage of a new world of opportunity. We are a team of 80,000 strong, working with over 6,000 clients, including 80% of the Fortune 500, across North America, Europe and Asia. As an industry leader in Full-Stack Technology Services, Talent Services, and real-world application, we work with progressive leaders to drive change. That's the power of true partnership. TEKsystems is an Allegis Group company. The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law. We are an equal opportunity employers and will consider all applications without regard to race, genetic information, sex, age, color, religion, national origin, veteran status, disability or any other characteristic protected by law. To view the EEO is the law poster click here. Applicants with disabilities that require an accommodation or assistance a position, please call 888-472-3411 or email mpowers@teksystems.com. This is a dedicated line designed exclusively to assist job seekers whose disability prevents them from being able to apply online. Messages left for other purposes will not receive a response."}
]